export default {
  // API 接口请求优先，数据格式保持和 data 一致
  api: 'https://xiao313.dpdns.org/.netlify/functions/talking',
  // api 为空则使用 data 静态数据 
  // 注意：图片请用 vh-img-flex 类包裹
   data: [
   {
      "date": "2025-12-07 15:08:28",
      "tags": [
        "日常"
      ],
      "content": "记录第一条说说<p class=\"vh-img-flex\"><img src=\"https://api.mtyqx.cn/tapi/random.php\"></p>"
    },
    {
      "date": "2025-12-21 08:43:25",
      "tags": [
        "突发"
      ],
      "content": "昨天半夜评论区坏了，一直以为是我的问题，修了半天，结果发现waline评论区也坏了，到半夜12点左右的时候修好了😭，重新部署一下就好了"
    }
  ]
}